* TODO COMMENT Emacs Setup                                                   :ignore:
:PROPERTIES:
:CUSTOM_ID: COMMENT-Emacs-Setup
:END:

;; To investigate
;; https://github.com/grafov/rust-playground


;; started from http://emacs-bootstrap.com/

;; rust-mode
;; https://github.com/rust-lang/rust-mode

(use-package rust-mode
  :bind ( :map rust-mode-map
               (("C-c C-t" . racer-describe)
                ([?\t] .  company-indent-or-complete-common)))
  :config
  (progn
    ;; add flycheck support for rust (reads in cargo stuff)
    ;; https://github.com/flycheck/flycheck-rust
    (use-package flycheck-rust)

    ;; cargo-mode for all the cargo related operations
    ;; https://github.com/kwrooijen/cargo.el
    (use-package cargo
      :hook (rust-mode . cargo-minor-mode)
      :bind
      ("C-c C-c C-n" . cargo-process-new)) ;; global binding

    ;;; separedit ;; via https://github.com/twlz0ne/separedit.el
    (when nil use-package separedit
      :straight (separedit :type git :host github :repo "idcrook/separedit.el")
      :config
      (progn
        (define-key prog-mode-map (kbd "C-c '") #'separedit)
        (setq separedit-default-mode 'markdown-mode)))


        ;; TODO:NICE!
    ;;; racer-mode for getting IDE like features for rust-mode
    ;; https://github.com/racer-rust/emacs-racer
    (use-package racer
      :hook (rust-mode . racer-mode)
      :config
      (progn
        ;; package does this by default ;; set racer rust source path environment variable
        ;; (setq racer-rust-src-path (getenv "RUST_SRC_PATH"))
        (defun my-racer-mode-hook ()
          (set (make-local-variable 'company-backends)
               '((company-capf company-files)))
          (setq company-minimum-prefix-length 1)
          (setq indent-tabs-mode nil))

        (add-hook 'racer-mode-hook 'my-racer-mode-hook)

        ;; enable company and eldoc minor modes in rust-mode (racer-mode)
        (add-hook 'racer-mode-hook #'company-mode)
        (add-hook 'racer-mode-hook #'eldoc-mode)))

    (add-hook 'rust-mode-hook 'flycheck-mode)
    (add-hook 'flycheck-mode-hook 'flycheck-rust-setup)

    ;; format rust buffers on save using rustfmt
    (add-hook 'before-save-hook
              (lambda ()
                (when (eq major-mode 'rust-mode)
                  (rust-format-buffer))))))

)

#+end_src

#+RESULTS:

#+begin_src rust :exports none
fn main() {
    let x = 42;
    println!("{0}, this is {1}.", x, "bye");
}
#+end_src

#+RESULTS:
: 42, this is bye.

* Formatted text:  src_rust[:exports code]{format!, println!, dbg!}
:PROPERTIES:
:CUSTOM_ID: COMMENT-Formatted-text-print
:END:

We can write formatted text to a src_rust[:exports code]{String} object using
src_rust[:exports code]{format!} ---or print it to the console instead using
src_rust[:exports code]{println!}; both work the same and stringify their arguments.

# src_rust[:exports code]{ format! } is the same as src_rust[:exports code]{
# println! } but it makes a formatted text as a src_rust[:exports code]{ String }
# value.

Let's print /4 weeks and 31 days/ a few different ways:
#+begin_src rust
fn main() {
    // Placeholders `{}` will be replaced with arguments.
    println!("{} weeks and {} days", 4, 31);
    // Or using “format!” first.
    let it = format!("{} weeks and {} days", 4, 31);
    println!("{}", it);

    // Positional placeholders can be used.
    println!("{1} weeks and {0} days", 31, 4);

    // As can named arguments.
    println!("{all} weeks and {every} days", every = 31, all = 4);

    // We can mix and match.
    println!("{:?} weeks {1:?} {all} days", 4, "and", all = 31);

    // We can also “pretty print” expressions; useful for lots of data
    println!("{:#?}", ["4", "weeks", "and", "31", "days"]);

    // We can see an expression, its value, and its location in code.
    dbg!(it); // Prints: [src/main.rs:19] it = "4 weeks and 31 days"
    let n = dbg!(1 * 2 + 3) - 1; // Prints: [src/main.rs:20] 1 * 2 + 3 = 5
    assert!(n == 4);

    // Sometimes it may be useful to see the memory address of a variable.
    println!("{:p}", &n);
}
#+end_src

#+RESULTS:
#+begin_example
4 weeks and 31 days
4 weeks and 31 days
4 weeks and 31 days
4 weeks and 31 days
4 weeks "and" 31 days
[
    "4",
    "weeks",
    "and",
    "31",
    "days",
]
[src/main.rs:22] it = "4 weeks and 31 days"
[src/main.rs:23] 1 * 2 + 3 = 5
0x7ffeeefacd70
#+end_example

Notice that the ~{:?}~ placeholder prints text for debugging purposes; e.g.,
strings keep their quotes. Alternatively, the src_ruby[:exports code]{dbg!}
macro takes ownership of an expression, prints the file and line number of where
that ~dbg!~ call occurs along with the resulting value of that expression, and
returns ownership of the value ---this means that /almost anywhere/ there is an
expression 𝒳, we can just replace it with ~dbg!(𝒳)~ to get some useful debugging
information about it!
/The ~dbg!~ macro can be really helpful when you’re trying to figure out what your code is doing!/
- If you're doing lots of ~println!~ just to see values of variables/expressions,
  just use ~dbg!~ instead: ~println!("x = {}, y = {}", x, y)~ can be replaced by
  ~dbg!(x, y)~.

* A First look at Ownership: Why ~let x = ⋯; f(x); f(x)~ crashes
:PROPERTIES:
:CUSTOM_ID: a-first-look-at-ownership-why-let-x-f-x-f-x-crashes
:END:
# Understanding basic Ownership and Borrowing in Rust

# NOTE: Ownership and borrowing are so important to Rust, might as well get an
# early glimpse. If anything it sets the stage for the “Types” section below.

Many languages distinguish between ‘literals’ and ‘objects’, Rust does so with a
feature called /ownership/, which aims to prevent us from writing memory unsafe
code.

The following program looks like it should work without any problems...
#+begin_src rust -r -n
fn main() {
    let mut hi = "hello".to_string(); // We want an object; not a literal primitive. (ref:hi-def)

    fn speak(words: String) {
        println!("{}", words)
    }

    speak(hi); (ref:first-call)
    // speak(hi); // Whoops, the *value* of “me” has moved out of this *variable*! (ref:second-call)

    hi = "yup".to_string(); (ref:all-good)
    speak(hi)
}
#+end_src

#+RESULTS:
: hello
: yup

*Ownership* means /variables own their values/:
+ Line [[(hi-def)]]: The variable ~hi~ owns the string value ~"hello~."
+ Line [[(first-call)]]: The value ~"hello"~ is passed into the function ~speak~, and so
  /ownership of the value has moved/. In-particular, ~hi~ no longer owns a value and
  so cannot be /accessed/ after this line.
+ Line [[(second-call)]]: We try to call the function ~speak~ with a variable that has
  no value and so we get a /compile-time/ error.
+ Line [[(all-good)]]: We can fix this by letting the variable ~hi~ /own/ a value,
  then we can use it again.

If we do need access to a variable's value in multiple function calls, we will
have to pass it by /reference/ instead of by value.

#+begin_src rust -r -n
fn main() {
    let mut hi = "hello".to_string();

    fn speak(words: &String) { (ref:borrow)
        println!("{}", words)
    }

    speak(&hi);  // Works first time. (ref:use)
    speak(&hi);  // Works second time!
}
#+end_src

#+RESULTS:
: hello
: hello

*Borrowing* means /temporarily owning something/: Line [[(borrow)]] says this function
wants a /reference/ to a string value; then line [[(use)]] calls the function by
making a reference using the “borrow operator” ~&~.

+ A *reference* is a type that references another value in memory.
   # - They are created using the “borrow operator” ~&~.
  - They're useful when we don't want to pass “ownership” to control structures
    (such as for-loops) or functions.
   :References_mwe:
#+begin_src rust
fn main() {
    let mut x = 12; // :      i32
    let r = &mut x; // : &mut i32

    *r = 45;
    assert_eq!(x, 45);
}
#+end_src

#+RESULTS:

:end:

+ A variable binding can be immutably borrowed multiple times:
  - 🥳 ~let x = 1; let ref1 = &x; let ref2 = &x~.
  :Full_code:
  #+begin_src rust
fn main() {
    let x = 42;
    let x_ref1 = &x;
    let x_ref2 = &x;
    let x_ref3 = &x;
    println!("{} {} {}", x_ref1, x_ref2, x_ref3);
    assert!((x, x_ref1, x_ref2) == (42, &42, &42))
}
#+end_src
  :end:

+ While borrowed, a variable binding cannot be mutated:
  - 😦 ~let mut x = 1; let ref = &x; x = 2~
  :full-code:
   #+begin_src rust
fn main() {
    let mut x = 42;
    let x_ref = &x;
    x = 13;
    println!("x_ref = {}", x_ref);
    // error: cannot assign to `x` because it is borrowed
}
#+end_src
  :end:

+ While immutably borrowed, a variable cannot be mutably borrowed:
  - 😦 ~let mut x = 1; let ref1 = &x; let ref2 = &mut x~.
  :full-code:
    #+begin_src rust
fn main() {
    let mut x = 42;
    let x_ref1 = &x;
    let x_ref2 = &mut x;
    // error: cannot borrow `x` as mutable because it is also borrowed as immutable
    println!("x_ref1 = {}", x_ref1);
}
#+end_src
  :end:

--------------------------------------------------------------------------------

*Summary:* Rust provides two variants of most types, those that can be /owned/ and
those that cannot. Unowned types are passed-by-value, or copied.  Loosely put,
this is the difference between /literals/ and /objects/.
#+begin_src rust
fn main() {
    // Literals have no ownership, so the following works fine.
    let x: &str = "hello";
    let y = x;
    dbg!(x, y); // ⇒ "hello", "hello"

    // Objects have a single owner, so the following crashes.
    let x = String::from("hello");
    let y = x; // Now ‘y’ owns the string
    // dbg!(x, y); // Cannot use ‘x’ since it owns nothing!
}
#+end_src

*This is important:* /When we say ~let mut x = thing; let mut y = x~, are updates to
~y~ reflected in ~x~ or not?/ Yes, if ~thing~ is a literal; otherwise it doesn't matter
in Rust since ~x~ can no-longer be used ---multiple mutable references cause
trouble!

/Exercise!/ Confirm that references cannot be owned, by making a similar ~x, y~
setup as above.
:Solution:
    let obj = String::from("hello");

    let x = &obj;
    let y = x;
    dbg!(x, y);
:end:

(For the curious, ~String~ [[https://github.com/rust-lang/rust/blob/master/library/alloc/src/string.rs#L366-L368][is just]] a structure consisting of a vector of integers.)

Incidentally, another difference between literals and objects is their
/lifetimes/. (Objects are heap-allocated.)
#+begin_src rust
fn main() {
    // This works since literals are “static”; live forever.
    let x = { let y = &"hi"; y };

    // let x = { let y = &"hi".to_string(); y };
    // Error: The string object does not live long enough to be used anywhere else!
    // Note: Consider using a `let` binding to create a longer lived value.

    dbg!(x);
}
#+end_src

/Exercise!/ By making similar ~x, y~ setups as above, confirm that arrays ~[T; n]~ are
unowned and have static lifetimes, whereas vectors ~Vec<T>~ are owned and are
only have dedicated lifetimes.
:Solution:

# // Fails because a vector is heap-allocated, and it has a non-'static lifetime.
#+begin_src rust
fn main() {
    // This works since literals are “static”; live forever.
    let x = { let a: &[i32; 5] = &[1, 2, 3, 4, 5]; a };

    // let x = { let v: &Vec<i32> = &vec![1, 2, 3, 4, 5]; v };
    // Error: The vector ‘v’ does not live long enough to be used anywhere else!
    // Note: Consider using a `let` binding to create a longer lived value.

    dbg!(x);
}
#+end_src
:End:

* Tuples and Arrays
:PROPERTIES:
:CUSTOM_ID: COMMENT-Tuples-and-Arrays
:END:

# TUPLES
# A tuple is a general way of grouping together a number of values with a variety
# of types into one compound type. Tuples have a fixed length: once declared, they
# cannot grow or shrink in size.

# ARRAYS
# Another way to have a collection of multiple values is with an array. Unlike a
# tuple, every element of an array must have the same type. Arrays in Rust are
# different from arrays in some other languages because arrays in Rust have a
# fixed length, like tuples.

Both tuples and arrays collect multiple values and have fixed (non-growable)
sizes; the only difference is that the values in a tuple can be of a different
type whereas an array requires them to all have the same type.

#+begin_src rust :prologue
fn main() {
    // Create: Tuples, different types allowed
    let p = ('a', 1, 2.3, "bye");
    let q: (char, i32) = ('a', 12); // Explicit type annotation

    // Create: Arrays, can only be same type
    let a = [1, 2, 3];
    let b : [char; 2] = ['x', 'y']; // Explicit type annotation

    // Read: Tuples, with “ .𝒾 ” notation
    // Read: Arrays, with “ [𝒾] ” notation
    println!("{0}, {1}, {2}", q.0, p.3, a[1]); // p.4, a[4] ⇒ Error!

    // Both can be *destructured*, but must match in length
    let (_, me, _, you) = p; // ≈  let me = p.1; let you = p.3;
    let [_, them, _]    = a; // ≈  let them = a[1];

    // Example: A super simple way to swap
    let x = 1; let y = 2;
    assert!(x == 1 && y == 2);
    let (y, x) = (x, y);       // Shadowing
    assert!(x == 2 && y == 1);

    // Shorthand for constant arrays
    assert!([2, 2, 2, 2] == [2; 4]);
}
#+end_src

#+RESULTS:
: error: Could not compile `cargoUS5aVu`.

~[τ; n]~ is the type of arrays of length $n$ with elements from type τ.
#+latex: \newline
If τ is a value, then there is only one possible array: ~[τ, τ, ..., τ]~ (/n/-many
times).

# Arrays are useful when you have a list whose length you do not expect to change
# ---e.g., a list of the months.
#
# A vector is a similar collection type provided by the standard library that is
# allowed to grow or shrink in size. If you’re unsure whether to use an array or a
# vector, you should probably use a vector. Chapter 8 discusses vectors in more
# detail.

# Invalid array index ⇒ Immediate program exit; a run-time error.
#
# The program resulted in a runtime error at the point of using an invalid value
# in the indexing operation. The program exited at that point with an error
# message and didn't execute the final println!. When you attempt to access an
# element using indexing, Rust will check that the index you’ve specified is less
# than the array length. If the index is greater than or equal to the array
# length, Rust will panic. This check has to happen at runtime, especially in this
# case, because the compiler can't possibly know what the value a user running the
# code will later enter.


We can loop over an array as follows.
#+begin_src rust
fn main() {
    let names = ["me", "you", "them"];
    for name in names {
        println!("{}", name)
    }
}
#+end_src

#+RESULTS:
: me
: you
: theme

/Exercise!/ Use a vector, src_rust[:exports code]{let names = vec!["me", "you",
"them"]}, and try to (/debug/-)print src_rust[:exports code]{names} after the
loop. Notice that src_rust[:exports code]{name} lost /ownership/ of its value to
the src_rust[:exports code]{for⋯in} loop. Fix this by giving the loop a
reference, src_rust[:exports code]{&names}.
:Solution:
#+begin_src rust
fn main() {
    let names = vec!["me", "you", "theme"];
    for name in &names {
        println!("{}", name)
    }
    println!("{:?}", names)
}
#+end_src
:End:

* Slices ---and ~str~
:PROPERTIES:
:CUSTOM_ID: Slices-and-str
:END:

If we have an array/vector/string/collection, how do we reference a slice of
their memory; i.e., narrow our view to a sub-part of the entire whole? The
answer is “slice types”.

Slices are similar to arrays, but their length is not known at compile
time. Essentially, slices are “views into segments of data” and [[https://stackoverflow.com/a/27150865/17693195][so consists of
two-parts]]: a pointer to the start of the data, and the length of the
data. Below, with a bit of [[https://stackoverflow.com/a/24761180/17693195][pointer arithmetic]], we can use slices as these
two-parts ---but this is not recommended!

- [[https://doc.rust-lang.org/reference/types/slice.html][A slice]], ~[τ]~, is a view into a block of memory. Whether mutable or not, /a
  slice always borrows/ and that is why it is always behind a [[https://doc.rust-lang.org/reference/types/pointer.html][pointer]], &.  Thus,
  sometimes people say “slices are &[τ]”.
- Since references are unowned, so too slices ~&[τ]~ are unowned.

#+begin_src rust
fn main() {
    let array: [i32; 5] = [11, 22, 33, 44, 55];
    let slice: &[i32] = &array;

    // Decompose a slice into its two main parts
    let length = slice.len(); // ⇒ 3
    let pointer = slice.as_ptr(); // ⇒ Some memory address

    // The 𝓃th element is 𝓃-steps away from the starting pointer.
    // (This is why elements start at index 0.)
    dbg!(unsafe { *pointer.offset(1) }); // ⇒ 22

    // If you do a pointer offset out of bounds, like 4, you've just accessed more memory;
    // possibly by accident and not the memory you want!

    // Safe way to do indexing; which checks for bounds at run-time.
    let element = slice[2]; // ⇒ 33
                            // let element = slice[4]; // Index out of bounds error!

    // An even safer way, that does not crash at run-time.
    let element = slice.get(4); // ⇒ None

    // Get a sub-slice start at index 2 up to, and including, index 3.
    let sub: &[i32] = &slice[2..=3]; // ⇒ [33, 44]

    // You can (mutably) borrow a slice of a (mutable) vector, or string, etc.
    let mut v = vec![1, 2, 3, 4, 5];
    let s = &mut v[2..]; // ⇒ [3, 4, 5]
    s[0] = 333;
    assert!(s == [333, 4, 5]);
    assert!(v == vec![1, 2, 333, 4, 5]);
}
#+end_src

#+RESULTS:
: [src/main.rs:7] std::mem::size_of_val(&slice) = 16
: [src/main.rs:8] std::mem::size_of_val(&array) = 20
: [src/main.rs:16] unsafe { *pointer.offset(1) } = 22

# Rust has slices - they're a reference to multiple contiguous elements.

We borrow slices of ~x : τ~ using ~&x[..]~ /provided/ the type τ implements the ~Index~
and ~IndexMut~ traits, which let us using the indexing operator.  The “..”  syntax
is for range literals: ~.., 0.., ..20, ..=20, 3..6~ are all example ranges with
~m..n~ denoting all integers $i$ with $m ≤ i < n$ ---and the right-bound can be
made inclusive using ‘=’. More concretely, ~(..=20).contains(&13)~ is true since
the range ~..=20~ is all integers at-most 20.
- References are implicitly converted into slices, when possible, by treating ~&x~
  as if it were ~&x[..]~.

[Mutable Slices] /Notice that changing the value of a slice index also changes
the value in the/ /underlying array/vector/string ---which actually owns the
values that the slice is letting us look at./

Since slices can be formed from vectors and arrays, if we want a function to
work on both kinds of values, we make our function consume a slice: Values of
~&Vec<T>~ and ~&[T; n]~ are implicitly transformed into values of ~&[T]~.
- Likewise, for ~&str~ and ~String~, the more generic approach is functions
  consuming ~&str~.

Rust's strings are all Unicode and so characters differ in size, as such string
slices cannot be implemented with a pointer and accessed with a uniform offset,
like ~[T]~. As such, there is a special type ~str~, “string slices”, which fullfills
this role. ~str~ really acts like slice types; e.g., ~"hello"~ has type ~str~ and
~&"hello"[1..]~ has type ~&str~; yet ~assert!(&"hello"[1..] == "ello")~ is true.


:Examples:
#+begin_src rust
fn main() {
    dbg!((..=20).contains(&-13));

    // 0 or greater
    println!("{:?}", (0..).contains(&100)); // true
                                            // strictly less than 20
    println!("{:?}", (..20).contains(&20)); // false
                                            // 20 or less than 20
    println!("{:?}", (..=20).contains(&20)); // true
                                             // only 3, 4, 5
    println!("{:?}", (3..6).contains(&4)); // true
}
#+end_src
:End:

** COMMENT Making ~README.org~
  :PROPERTIES:
  :CUSTOM_ID: COMMENT-Making-README-org
  :END:

  Evaluate the following source block with ~C-c C-c~
  to produce a ~README~ file.

  # :'( For some reason using {{{title}}} below would not work.

#+NAME: make-readme
#+BEGIN_SRC emacs-lisp
(with-temp-buffer
    (insert
    "#+EXPORT_FILE_NAME: README.md
     ,#+HTML: <h1> AngularJSCheatSheet </h1>
     ,#+OPTIONS: toc:nil d:nil
     # Toc is displayed below at a strategic position.

     {{{blurb}}}

    ,*The listing sheet, as PDF, can be found
     [[file:CheatSheet.pdf][here]]*;
     while below is an unruly html rendition
     ---there is also a
     badge:beautiful|HTML_webpage|success|https://alhassy.github.io/RustCheatSheet|javascript (•̀ᴗ•́)و

     # Markdown links: [title](target)

     This reference sheet is built from a
     [[https://github.com/alhassy/CheatSheet][CheatSheets with Org-mode]]
     system.

     ,#+TOC: headlines 2
     ,#+INCLUDE: CheatSheet.org
    ")

    ;; No code execution on export
    ;; ⟪ For a particular block, we use “:eval never-export” ⟫
    ;;
    (let ((org-export-use-babel nil))
      (org-mode)
      (org-md-export-to-markdown)
      )
)
#+END_SRC

#+RESULTS: make-readme
: README.md

Note that the ~blurb~ macro is defined by the user, to provide a terse description of the project.
   - Think the one-line statement at the top of a github repo page.

#    The ~d:nil~ ensures the ‘drawer’ ~:Hide: ⋯ :End:~ is not exported; it's there for me
#    as a reminder.
* TODO COMMENT [[https://doc.rust-lang.org/book/ch05-02-example-structs.html][Structures]] ---“Tuples with /named and unordered/ components”
:PROPERTIES:
:CUSTOM_ID: COMMENT-https-doc-rust-lang-org-book-ch05-02-example-structs-html-Structures-Tuples-with-named-and-unordered-components
:END:

Structures /provide ways to group several values into a single value./
/Conceptually, this allows us to put a bunch of related things in a bag and run
around with the bag, instead of wrapping our arms around all of the individual/
/things and trying to hold on to them separately./ ---[[https://eloquentjavascript.net/04_data.html#p_78ZfHX5x1B][Eloquent JavaScript]]

A src_rust[:exports code]{struct}ure is also known as a /record, hashmap, association list,
lightweight-class, JSON object/.  Struct types are /formed/ as name-type pairs, and
their values are /constructed/ with ‘struct literals’: Name-value pairs preceded
by the struct name.

TODO: Maybe move tuples to be here? Since they're just anonomous structs?
https://doc.rust-lang.org/reference/types/struct.html

[Note that tuples, arrays, enums, and ranges can all be /thought of/ as
specialisations of the idea of structures. That is, structures are powerful
enough to implement the previously mentioned compound types.]

+ Tuples /quickly/ group related variables together, but structs give us /meaning/
  by /naming/ the variables ---instead of using numeric indices.

 #+begin_src rust :prologue "fn main() {" :epilogue "}"
// ⟨0⟩ Forming a new type
#[derive(Debug)]   // Simple debug printing
struct Person {
    name : String,
    job  : String,
    age  : u32
}

// ⟨1⟩ Introducing a value of that type
let mut job = String::from("farmer");
let mut jay = Person {
    name: String::from("jason"),
    age: 72,
    job // Shorthand for same name, but *cloned* value:   job: String::form("farmer")
};
// Mutability of “job” and “jay” are not related at all.
job = String::from("labourer");       // Has no effect on “jay”
assert!(jay.job == "farmer");

// ⟨2⟩ Eliminating a value of that type by destructuring
// [Ownership moves: If “jay.field” is an object, it has moved to “field”]
// [Namely, after this line, /read access/ of “jay.name” is invalid.]
let Person {name, age, ..} = jay; // The “..” are to ignore the rest

// ⟨3⟩ Updating a field [Give “jay.name” a value and so it is valid to read.]
jay.name = String::from("jasim");
assert!(jay.name == "jasim" && name == "jason");

// Using the automatic debug printing
println!("Jay is {:?}", jay); // Pretty print with: {:#?}

// ⟨4⟩ Let's attach a method to our struct instances
impl Person {
    fn speak(&self) {
        println!("{}: I am a {} years old.", self.name, self.age);
    }
}
// Let's use this method.
jay.speak();

// ⟨1⟩' Creating instances from instances; “prototyping”!
// [Read: kathy is like jay but has a different name.]
// [This “struct update syntax” can only happen in the last position.]
// [In-particular, “Person {..jay}” is a clone of the value “jay”.]
let kathy = Person {name: String::from("Kalthum"), ..jay};
// ⟨4⟩′ We can call methods using type-namespace syntax.
Person::speak(&kathy);

// ⟨1⟩″ We can also make unnamed fields, and use tuple indexing
struct Mine(String, u32);
let mut it = Mine(String::from("hola"), 23);
it.1 = 12;
 #+end_src

 #+RESULTS:
 : Jay is Person { name: "jasim", job: "farmer", age: 72 }
 : jasim: I am a 72 years old.
 : Kalthum: I am a 72 years old.

src_rust[:exports code]{// ⟨4⟩}
The function ~fn greet(p: &Person) { println!("{}: I am a {}.", p.name, p.job) }~
is very specific: It only works on ~Person~ values. As such, it's helpful to tie
this behaviour more closely to the ~Person~ struct, which can be done by moving it
into an “impl”ementation block. All methods in an ~impl~ block must have the first
argument named ~self~. As such, we could have written ~fn speak(self: &Person) {⋯}~.
However, within an ~impl~ block, the type ~Self~ is an alias for the type that the
~impl~ block is for. As such, we could have written ~fn speak(self: &Self) {⋯}~.
Since the first argument of methods must be /named/ ~self~ and /typed/ ~Self~, we can
just abbreviate it to ~self: Self~ to ~self~ ---however, in our case we use the
abbreviation ~&self~ because we want the value to be /borrowed/, not owned.

/Exercise!/ Change ~speak~ above to consume a mutable reference, ~&mut self~, that
increments the age. Two other non-mutable things will now break in the above
program; make them mutable. Make ~kathy~ speak twice and ~assert!~ her age has
changed.
:Solution:
#+begin_src rust
impl Person {
    fn speak(&mut self) {
        println!("{}: I am a {} years old.", self.name, self.age);
        self.age = self.age + 1
    }
}

let mut kathy = Person {name: String::from("Kalthum"), ..jay};

Person::speak(&mut kathy);
Person::speak(&mut kathy);
#+end_src

:End:

/Exercise!/ Struct methods can have the same name as struct fields ---whereas
arbitrary functions cannot share the name of variables. Change the method name src_rust[:exports code]{speak} to be src_rust[:exports
code]{age}.

# Everything within this impl block will be associated with the type.


# /Methods/ are different from functions in that they’re defined within the context
# of a struct (or an enum or a trait object), and their first parameter is always
# ~self~, which represents the instance of the struct the method is being called on.
# The /method syntax/ goes after an instance: we add a dot followed by the method name, parentheses, and any arguments.


-----

It’s possible for structs to store /references/ ---such as src_rust[:exports
code]{&str} values--- to data owned by something else, but to do so requires the
use of “lifetimes”, a Rust feature that ensures that the data referenced by a
struct is valid for as long as the struct is. The use of references in a
structure definition means that the structure does not own all of its data, but
that some of its data is borrowed.

--------------------------------------------------------------------------------

#+begin_src rust
// The `derive` attribute automatically creates the implementation
// required to make this `struct` printable with `fmt::Debug`.
#[derive(Debug)]
struct DebugPrintable(i32);
#+end_src


// To use the `{}` marker, the trait `fmt::Display` must be implemented
// manually for the type.
- https://doc.rust-lang.org/rust-by-example/hello/print/print_display.html
- https://doc.rust-lang.org/rust-by-example/hello/print/print_debug.html
- https://doc.rust-lang.org/rust-by-example/hello/print/fmt.html

** Structs can be generic too:
:PROPERTIES:
:CUSTOM_ID: Structs-can-be-generic-too
:END:

#+begin_src rust
struct Pair<T> {
    a: T,
    b: T,
}

fn print_type_name<T>(_val: &T) {
    println!("{}", std::any::type_name::<T>());
}

fn main() {
    let p1 = Pair { a: 3, b: 9 };
    let p2 = Pair { a: true, b: false };
    print_type_name(&p1); // prints "Pair<i32>"
    print_type_name(&p2); // prints "Pair<bool>"
}
#+end_src

#+RESULTS:
: cargoXvOHKv::Pair<i32>
: cargoXvOHKv::Pair<bool>


* TODO COMMENT [FOR/ITER] Anything that is iterable can be used in a for in loop.
:PROPERTIES:
:CUSTOM_ID: COMMENT-Anything-that-is-iterable-can-be-used-in-a-for-in-loop
:END:

We've just seen a range being used, but it also works with a Vec; or a slice:

#+begin_src rust
fn main() {
    for i in (1..=3).rev() {
        // RANGE
        println!("{}", i)
    }

    for i in vec![52, 49, 21] {
        // VECTOR
        println!("I like the number {}", i);
    }

    for i in &[52, 49, 21] {
        // SLICE
        println!("I like the number {}", i);
    }

    // note: `&str` also has a `.bytes()` iterator.
    // Rust's `char` type is a "Unicode scalar value"
    for c in "rust".chars() {
        println!("Give me a {}", c);
    }

    // Even if the iterator items are filtered and mapped and flattened:
    for c in "SuRPRISE INbOUND"
        .chars()
        .filter(|c| c.is_lowercase())
        .flat_map(|c| c.to_uppercase())
    {
        print!("{}", c);
    }
}
#+end_src

#+RESULTS:
#+begin_example
3
2
1
I like the number 52
I like the number 49
I like the number 21
I like the number 52
I like the number 49
I like the number 21
Give me a r
Give me a u
Give me a s
Give me a t
UB
#+end_example

#+begin_src rust
for (index, item) in slice.iter().enumerate() {
    println!("index: {:?} element {:?}", index, item);
}
#+end_src


Finding values in a slice:

slice.iter().position(|v| v == &120); // None
slice.iter().position(|v| v == &4); // Some(4)

